; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-12)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city8)
	(fuel-level plane1 fl3)
	(at plane2 city12)
	(fuel-level plane2 fl3)
	(at plane3 city1)
	(fuel-level plane3 fl5)
	(at plane4 city3)
	(fuel-level plane4 fl6)
	(at plane5 city11)
	(fuel-level plane5 fl0)
	(at plane6 city5)
	(fuel-level plane6 fl5)
	(at plane7 city2)
	(fuel-level plane7 fl1)
	(at person1 city9)
	(at person2 city11)
	(at person3 city1)
	(at person4 city7)
	(at person5 city10)
	(at person6 city12)
	(at person7 city4)
	(at person8 city4)
	(at person9 city2)
	(at person10 city12)
	(at person11 city5)
	(at person12 city6)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city11)
	(at plane3 city6)
	(at plane6 city7)
	(at person1 city8)
	(at person2 city9)
	(at person3 city11)
	(at person4 city5)
	(at person5 city0)
	(at person6 city3)
	(at person7 city1)
	(at person8 city7)
	(at person9 city1)
	(at person10 city3)
	(at person11 city0)
	(at person12 city12)
	))

)

; plan
1. (board person9 plane7 city2)
   deleted: (at person9 city2)
   added: (in person9 plane7)
   goals met: 0 of 15
2. (fly plane7 city2 city1 fl1 fl0)
   deleted: (at plane7 city2) (fuel-level plane7 fl1)
   added: (at plane7 city1) (fuel-level plane7 fl0)
   goals met: 0 of 15
3. (debark person9 plane7 city1)
   deleted: (in person9 plane7)
   added: (at person9 city1)
   goals met: 1 of 15
4. (zoom plane6 city5 city4 fl5 fl4 fl3)
   deleted: (at plane6 city5) (fuel-level plane6 fl5)
   added: (at plane6 city4) (fuel-level plane6 fl3)
   goals met: 1 of 15
5. (board person8 plane6 city4)
   deleted: (at person8 city4)
   added: (in person8 plane6)
   goals met: 1 of 15
6. (zoom plane6 city4 city7 fl3 fl2 fl1)
   deleted: (at plane6 city4) (fuel-level plane6 fl3)
   added: (at plane6 city7) (fuel-level plane6 fl1)
   goals met: 2 of 15
7. (debark person8 plane6 city7)
   deleted: (in person8 plane6)
   added: (at person8 city7)
   goals met: 3 of 15
8. (board person4 plane6 city7)
   deleted: (at person4 city7)
   added: (in person4 plane6)
   goals met: 3 of 15
9. (board person2 plane5 city11)
   deleted: (at person2 city11)
   added: (in person2 plane5)
   goals met: 3 of 15
10. (refuel plane5 city11 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 3 of 15
11. (fly plane5 city11 city9 fl1 fl0)
   deleted: (at plane5 city11) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 3 of 15
12. (debark person2 plane5 city9)
   deleted: (in person2 plane5)
   added: (at person2 city9)
   goals met: 4 of 15
13. (board person1 plane5 city9)
   deleted: (at person1 city9)
   added: (in person1 plane5)
   goals met: 4 of 15
14. (refuel plane5 city9 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 4 of 15
15. (fly plane5 city9 city8 fl1 fl0)
   deleted: (at plane5 city9) (fuel-level plane5 fl1)
   added: (at plane5 city8) (fuel-level plane5 fl0)
   goals met: 4 of 15
16. (debark person1 plane5 city8)
   deleted: (in person1 plane5)
   added: (at person1 city8)
   goals met: 5 of 15
17. (zoom plane3 city1 city6 fl5 fl4 fl3)
   deleted: (at plane3 city1) (fuel-level plane3 fl5)
   added: (at plane3 city6) (fuel-level plane3 fl3)
   goals met: 6 of 15
18. (board person3 plane7 city1)
   deleted: (at person3 city1)
   added: (in person3 plane7)
   goals met: 6 of 15
19. (refuel plane7 city1 fl0 fl1)
   deleted: (fuel-level plane7 fl0)
   added: (fuel-level plane7 fl1)
   goals met: 6 of 15
20. (fly plane7 city1 city11 fl1 fl0)
   deleted: (at plane7 city1) (fuel-level plane7 fl1)
   added: (at plane7 city11) (fuel-level plane7 fl0)
   goals met: 6 of 15
21. (debark person3 plane7 city11)
   deleted: (in person3 plane7)
   added: (at person3 city11)
   goals met: 7 of 15
22. (board person12 plane3 city6)
   deleted: (at person12 city6)
   added: (in person12 plane3)
   goals met: 7 of 15
23. (board person6 plane2 city12)
   deleted: (at person6 city12)
   added: (in person6 plane2)
   goals met: 7 of 15
24. (board person10 plane2 city12)
   deleted: (at person10 city12)
   added: (in person10 plane2)
   goals met: 7 of 15
25. (zoom plane2 city12 city3 fl3 fl2 fl1)
   deleted: (at plane2 city12) (fuel-level plane2 fl3)
   added: (at plane2 city3) (fuel-level plane2 fl1)
   goals met: 7 of 15
26. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   goals met: 8 of 15
27. (debark person10 plane2 city3)
   deleted: (in person10 plane2)
   added: (at person10 city3)
   goals met: 9 of 15
28. (zoom plane1 city8 city10 fl3 fl2 fl1)
   deleted: (at plane1 city8) (fuel-level plane1 fl3)
   added: (at plane1 city10) (fuel-level plane1 fl1)
   goals met: 9 of 15
29. (board person5 plane1 city10)
   deleted: (at person5 city10)
   added: (in person5 plane1)
   goals met: 9 of 15
30. (zoom plane3 city6 city12 fl3 fl2 fl1)
   deleted: (at plane3 city6) (fuel-level plane3 fl3)
   added: (at plane3 city12) (fuel-level plane3 fl1)
   goals met: 8 of 15
31. (debark person12 plane3 city12)
   deleted: (in person12 plane3)
   added: (at person12 city12)
   goals met: 9 of 15
32. (fly plane3 city12 city6 fl1 fl0)
   deleted: (at plane3 city12) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 10 of 15
33. (fly plane1 city10 city0 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 10 of 15
34. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 10 of 15
35. (debark person5 plane1 city0)
   deleted: (in person5 plane1)
   added: (at person5 city0)
   goals met: 11 of 15
36. (fly plane1 city0 city11 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city11) (fuel-level plane1 fl0)
   goals met: 12 of 15
37. (fly plane2 city3 city4 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 12 of 15
38. (zoom plane4 city3 city5 fl6 fl5 fl4)
   deleted: (at plane4 city3) (fuel-level plane4 fl6)
   added: (at plane4 city5) (fuel-level plane4 fl4)
   goals met: 12 of 15
39. (board person11 plane4 city5)
   deleted: (at person11 city5)
   added: (in person11 plane4)
   goals met: 12 of 15
40. (zoom plane4 city5 city0 fl4 fl3 fl2)
   deleted: (at plane4 city5) (fuel-level plane4 fl4)
   added: (at plane4 city0) (fuel-level plane4 fl2)
   goals met: 12 of 15
41. (debark person11 plane4 city0)
   deleted: (in person11 plane4)
   added: (at person11 city0)
   goals met: 13 of 15
42. (zoom plane4 city0 city4 fl2 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl2)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 13 of 15
43. (board person7 plane4 city4)
   deleted: (at person7 city4)
   added: (in person7 plane4)
   goals met: 13 of 15
44. (refuel plane4 city4 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 15
45. (fly plane4 city4 city1 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 13 of 15
46. (debark person7 plane4 city1)
   deleted: (in person7 plane4)
   added: (at person7 city1)
   goals met: 14 of 15
47. (fly plane6 city7 city5 fl1 fl0)
   deleted: (at plane6 city7) (fuel-level plane6 fl1)
   added: (at plane6 city5) (fuel-level plane6 fl0)
   goals met: 13 of 15
48. (refuel plane6 city5 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 13 of 15
49. (debark person4 plane6 city5)
   deleted: (in person4 plane6)
   added: (at person4 city5)
   goals met: 14 of 15
50. (fly plane6 city5 city7 fl1 fl0)
   deleted: (at plane6 city5) (fuel-level plane6 fl1)
   added: (at plane6 city7) (fuel-level plane6 fl0)
   goals met: 15 of 15
